app/controllers/application_controller.rb

  def update_timezone(timezone)
    Time.zone = timezone || 'UTC'
    current_user.update!(timezone:)
---
UPDATE "users" SET "updated_at" = ?, "timezone" = ? WHERE "users"."id" = ?  [["updated_at", "2024-01-22 08:17:04.958116"], ["timezone", "UTC"], ["id", 1]]