app/controllers/users_controller.rb

  def update
    binding.pry

    @user = current_user
    respond_to do |format|
      if @user.update(office_hours_params)
---
UPDATE "users" SET "updated_at" = ?, "office_hours_start" = ?, "office_hours_end" = ? WHERE "users"."id" = ?  [["updated_at", "2024-01-22 09:04:13.820806"], ["office_hours_start", "2000-01-01 08:00:00"], ["office_hours_end", "2000-01-01 16:00:00"], ["id", 1]]